## Plan Result (test_frontendappgateway - TerraformPlanApply)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.frontendappgateway.azurerm_application_gateway.ag[0]
  * module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw"
        name                              = "cft-aks-fe-00-perftest-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendAddressPools/bar" -> null
          - ip_addresses = [
              - "10.48.79.250",
              - "10.48.95.250",
            ] -> null
          - name         = "bar" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/adoption-web" -> null
          - name                                = "adoption-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/adoption-web" -> null
          - probe_name                          = "adoption-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/bar" -> null
          - name                                = "bar" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/bar" -> null
          - probe_name                          = "bar" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/cft-api-mgmt" -> null
          - name                                = "cft-api-mgmt" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/cft-api-mgmt" -> null
          - probe_name                          = "cft-api-mgmt" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/civil-citizen-ui" -> null
          - name                                = "civil-citizen-ui" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/civil-citizen-ui" -> null
          - probe_name                          = "civil-citizen-ui" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/cmc" -> null
          - name                                = "cmc" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/cmc" -> null
          - probe_name                          = "cmc" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/cmc-legal" -> null
          - name                                = "cmc-legal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/cmc-legal" -> null
          - probe_name                          = "cmc-legal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/cui-ra" -> null
          - name                                = "cui-ra" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/cui-ra" -> null
          - probe_name                          = "cui-ra" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/div-da" -> null
          - name                                = "div-da" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/div-da" -> null
          - probe_name                          = "div-da" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/div-dn" -> null
          - name                                = "div-dn" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/div-dn" -> null
          - probe_name                          = "div-dn" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/div-pfe" -> null
          - name                                = "div-pfe" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/div-pfe" -> null
          - probe_name                          = "div-pfe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/div-rfe" -> null
          - name                                = "div-rfe" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/div-rfe" -> null
          - probe_name                          = "div-rfe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/dss-update-case" -> null
          - name                                = "dss-update-case" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/dss-update-case" -> null
          - probe_name                          = "dss-update-case" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/em-icp" -> null
          - name                                = "em-icp" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/em-icp" -> null
          - probe_name                          = "em-icp" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/et-sya" -> null
          - name                                = "et-sya" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/et-sya" -> null
          - probe_name                          = "et-sya" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/et-syr" -> null
          - name                                = "et-syr" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/et-syr" -> null
          - probe_name                          = "et-syr" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/fact" -> null
          - name                                = "fact" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/fact" -> null
          - probe_name                          = "fact" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/backendHttpSettingsCollection/fact-admin" -> null
          - name                                = "fact-admin" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw/probes/fact-admin" -> null
          - probe_name                          = "fact-admin" -> null
          - protocol                      

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

+ rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "div-pfe"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "div-pfe"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "div-pfe"
          + id                          = (known after apply)
          + name                        = "div-pfe"
          + priority                    = 330
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "div-rfe"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "div-rfe"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "div-rfe"
          + id                          = (known after apply)
          + name                        = "div-rfe"
          + priority                    = 320
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "dss-update-case"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "dss-update-case"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "dss-update-case"
          + id                          = (known after apply)
          + name                        = "dss-update-case"
          + priority                    = 420
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "em-icp"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "em-icp"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "em-icp"
          + id                          = (known after apply)
          + name                        = "em-icp"
          + priority                    = 440
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "et-sya"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "et-sya"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "et-sya"
          + id                          = (known after apply)
          + name                        = "et-sya"
          + priority                    = 390
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "et-syr"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "et-syr"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "et-syr"
          + id                          = (known after apply)
          + name                        = "et-syr"
          + priority                    = 450
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "fees-register"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "fees-register"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "fees-register"
          + id                          = (known after apply)
          + name                        = "fees-register"
          + priority                    = 210
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "hmi-apim"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "hmi-apim"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "hmi-apim"
          + id                          = (known after apply)
          + name                        = "hmi-apim"
          + priority                    = 270
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "ia-aip"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "ia-aip"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "ia-aip"
          + id                          = (known after apply)
          + name                        = "ia-aip"
          + priority                    = 250
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "idam-user-dashboard"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "idam-user-dashboard"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "idam-user-dashboard"
          + id                          = (known after apply)
          + name                        = "idam-user-dashboard"
          + priority                    = 290
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "paymentoutcome-web"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "paymentoutcome-web"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "paymentoutcome-web"
          + id                          = (known after apply)
          + name                        = "paymentoutcome-web"
          + priority                    = 370
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "pcs-frontend"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "pcs-frontend"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "pcs-frontend"
          + id                          = (known after apply)
          + name                        = "pcs-frontend"
          + priority                    = 460
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "plum"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "plum"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "plum"
          + id                          = (known after apply)
          + name                        = "plum"
          + priority                    = 380
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "privatelaw"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "privatelaw"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "privatelaw"
          + id                          = (known after apply)
          + name                        = "privatelaw"
          + priority                    = 360
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "reformscan"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "reformscan"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "reformscan"
          + id                          = (known after apply)
          + name                        = "reformscan"
          + priority                    = 280
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "sptribs-dss-update-case-web"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "sptribs-dss-update-case-web"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "sptribs-dss-update-case-web"
          + id                          = (known after apply)
          + name                        = "sptribs-dss-update-case-web"
          + priority                    = 410
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "sptribs-frontend"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "sptribs-frontend"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "sptribs-frontend"
          + id                          = (known after apply)
          + name                        = "sptribs-frontend"
          + priority                    = 400
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-approve-org"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-approve-org"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-approve-org"
          + id                          = (known after apply)
          + name                        = "xui-approve-org"
          + priority                    = 220
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-manage-org"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-manage-org"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-manage-org"
          + id                          = (known after apply)
          + name                        = "xui-manage-org"
          + priority                    = 230
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-register-org"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-register-org"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-register-org"
          + id                          = (known after apply)
          + name                        = "xui-register-org"
          + priority                    = 240
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "xui-webapp"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "xui-webapp"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "xui-webapp"
          + id                          = (known after apply)
          + name                        = "xui-webapp"
          + priority                    = 260
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (54 unchanged blocks hidden)
    }

  # module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw|app-gw-storage-account"
        name                           = "app-gw-storage-account"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label test_frontendappgateway - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/azure-platform-terraform/issues/2411/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":2411,"Program":"tfcmt","SHA1":"","Target":"test_frontendappgateway - TerraformPlanApply","Vars":{}} -->